# Основы Pandas

## Загрузка данных

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('ds_salaries_mod.csv')

Наши задачи на этом уроке:

- обзор данных;
- предобработка данных;
- анализ, проверка гипотез.

## Обзор данных

In [38]:
df

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
0,2023,SE,FT,Principal Data Scientist,80000,EUR,85847.0,ES,100,ES,L
1,2023,MI,CT,ML Engineer,30000,USD,30000.0,US,100,US,S
2,2023,MI,CT,ML Engineer,25500,USD,25500.0,US,100,US,S
3,2023,SE,FT,Data Scientist,175000,USD,175000.0,CA,100,CA,M
4,2023,SE,FT,Data Scientist,120000,USD,120000.0,CA,100,CA,M
...,...,...,...,...,...,...,...,...,...,...,...
3750,2020,SE,FT,Data Scientist,412000,USD,412000.0,US,100,US,L
3751,2021,MI,FT,Principal Data Scientist,151000,USD,151000.0,US,100,US,L
3752,2020,EN,FT,Data Scientist,105000,USD,105000.0,US,100,US,S
3753,2020,EN,CT,Business Data Analyst,100000,USD,100000.0,US,100,US,L
3754,2021,SE,FT,Data Science Manager,7000000,INR,94665.0,IN,50,IN,L

EN MI SE EX

In [ ]:
df.head(10)

In [ ]:
df.tail(3)

In [ ]:
df.sample(5, random_state=177013)

In [ ]:
df.sample(frac=0.001)

In [88]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3755 entries, 0 to 3754
Data columns (total 12 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           3755 non-null   int64
 1   experience_level    3755 non-null   object
 2   employment_type     3755 non-null   object
 3   job_title           3755 non-null   object
 4   salary              3755 non-null   int64
 5   salary_currency     3755 non-null   object
 6   salary_in_usd       2871 non-null   float64
 7   employee_residence  3755 non-null   object
 8   remote_ratio        3755 non-null   int64
 9   company_location    3755 non-null   object
 10  company_size        3755 non-null   object
 11  same_country        3755 non-null   bool
dtypes: bool(1), float64(1), int64(3), object(7)
memory usage: 326.5+ KB

## Удаление пропусков

In [22]:
df_clean = df.dropna()

In [23]:
df_clean.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 0 entries
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   work_year           0 non-null      int64
 1   experience_level    0 non-null      object
 2   employment_type     0 non-null      object
 3   job_title           0 non-null      object
 4   salary              0 non-null      int64
 5   salary_currency     0 non-null      object
 6   salary_in_usd       0 non-null      float64
 7   employee_residence  0 non-null      object
 8   remote_ratio        0 non-null      int64
 9   company_location    0 non-null      object
 10  company_size        0 non-null      object
dtypes: float64(1), int64(3), object(7)
memory usage: 0.0+ bytes

## Проверка на дубликаты

In [20]:
df.duplicated().sum()

0

In [ ]:
# df = df.drop_duplicates()

## Индексация

In [39]:
df['salary_in_usd']

0        85847.0
1        30000.0
2        25500.0
3       175000.0
4       120000.0
          ...
3750    412000.0
3751    151000.0
3752    105000.0
3753    100000.0
3754     94665.0
Name: salary_in_usd, Length: 3755, dtype: float64

### Классическая

In [40]:
year_2023 = (df['work_year'] == 2023)

In [41]:
year_2023

0        True
1        True
2        True
3        True
4        True
        ...
3750    False
3751    False
3752    False
3753    False
3754    False
Name: work_year, Length: 3755, dtype: bool

In [42]:
df[year_2023].tail()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
1815,2023,SE,FT,Machine Learning Engineer,134500,USD,134500.0,US,0,US,L
1817,2023,MI,FT,Data Scientist,130000,USD,130000.0,US,0,US,M
1818,2023,MI,FT,Data Scientist,90000,USD,90000.0,US,0,US,M
1819,2023,EN,FT,Data Engineer,160000,USD,160000.0,US,0,US,M
1820,2023,EN,FT,Data Engineer,135000,USD,135000.0,US,0,US,M

In [43]:
df[df['work_year'] == 2023].tail()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
1815,2023,SE,FT,Machine Learning Engineer,134500,USD,134500.0,US,0,US,L
1817,2023,MI,FT,Data Scientist,130000,USD,130000.0,US,0,US,M
1818,2023,MI,FT,Data Scientist,90000,USD,90000.0,US,0,US,M
1819,2023,EN,FT,Data Engineer,160000,USD,160000.0,US,0,US,M
1820,2023,EN,FT,Data Engineer,135000,USD,135000.0,US,0,US,M

### Query

In [81]:
df.query('work_year == 2023').tail()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,same_country
1815,2023,SE,FT,Machine Learning Engineer,134500,USD,134500.0,US,0,US,L,True
1817,2023,MI,FT,Data Scientist,130000,USD,130000.0,US,0,US,M,True
1818,2023,MI,FT,Data Scientist,90000,USD,90000.0,US,0,US,M,True
1819,2023,EN,FT,Data Engineer,160000,USD,160000.0,US,0,US,M,True
1820,2023,EN,FT,Data Engineer,135000,USD,135000.0,US,0,US,M,True

### .loc() и .iloc()

In [82]:
df_2022 = df[df['work_year'] == 2022]

In [83]:
df_2022.head()

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,same_country
41,2022,MI,FT,Machine Learning Engineer,1650000,INR,20984.0,IN,50,IN,L,True
83,2022,EN,FT,AI Developer,300000,USD,300000.0,IN,50,IN,L,True
114,2022,EN,FT,Machine Learning Engineer,54000,CHF,56536.0,CH,100,CH,S,True
249,2022,SE,FT,Data Scientist,84000,EUR,NaN,ES,100,GB,L,False
323,2022,SE,FT,AI Developer,275000,USD,275000.0,CA,0,CA,S,True

In [84]:
df_2022.iloc[0:1]

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,same_country
41,2022,MI,FT,Machine Learning Engineer,1650000,INR,20984.0,IN,50,IN,L,True

In [85]:
df_2022.loc[0:1]

Empty DataFrame
Columns: [work_year, experience_level, employment_type, job_title, salary, salary_currency, salary_in_usd, employee_residence, remote_ratio, company_location, company_size, same_country]
Index: []

In [86]:
df_2022.loc[41:42]

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size,same_country
41,2022,MI,FT,Machine Learning Engineer,1650000,INR,20984.0,IN,50,IN,L,True

## Простейший анализ

### Значения по количеству

In [91]:
df['salary_in_usd'].value_counts()

150000.0    77
100000.0    77
120000.0    68
160000.0    67
130000.0    58
            ..
123700.0     1
74540.0      1
74178.0      1
107500.0     1
94665.0      1
Name: salary_in_usd, Length: 895, dtype: int64

### Сортировка столбца по значению

In [92]:
df_clean['salary_in_usd'].sort_values()

Series([], Name: salary_in_usd, dtype: float64)

### Основная статистика

In [97]:
df['salary_in_usd' != float64 ].describe()

NameError: name 'float64' is not defined

In [11]:
df[df['work_year'] == 2023]['salary_in_usd'].mean()

149508.4592809978

In [54]:
df[df['work_year'] == 2022]['salary_in_usd'].mean()

133438.8639562158

## Операции над столбцами

In [9]:
df['company_location'] == df['employee_residence']

0       True
1       True
2       True
3       True
4       True
        ...
3750    True
3751    True
3752    True
3753    True
3754    True
Length: 3755, dtype: bool

In [55]:
df['same_country'] = (df['company_location'] == df['employee_residence'])

In [56]:
df['same_country'].value_counts()

True     3659
False      96
Name: same_country, dtype: int64

In [87]:
df['employment_type'] + ' ' + df['job_title']

0       FT Principal Data Scientist
1                    CT ML Engineer
2                    CT ML Engineer
3                 FT Data Scientist
4                 FT Data Scientist
                   ...
3750              FT Data Scientist
3751    FT Principal Data Scientist
3752              FT Data Scientist
3753       CT Business Data Analyst
3754        FT Data Science Manager
Length: 3755, dtype: object

In [ ]:
def categorize(x):
    return 'High' if x > 200000 else 'Normal'

In [ ]:
df['salary_in_usd'].apply(categorize)

In [ ]:
df['salary_range'] = df['salary_in_usd'].apply(categorize)

In [ ]:
df.tail()

## Заполнение пропусков

In [ ]:
df_clean = df.copy()

In [ ]:
df_clean[df_clean['salary_in_usd'].isna()].head()

In [ ]:
df_clean['salary_in_usd'] = df_clean['salary_in_usd'].fillna(df_clean['salary_in_usd'].median())

In [ ]:
df_clean[df['salary_in_usd'].isna()].head()

## Группировка

### Как изменяются зарплаты со временем?

In [6]:
df.groupby('work_year')['salary_in_usd'].mean()

work_year
2020     89881.483333
2021     92781.644970
2022    133438.863956
2023    149508.459281
Name: salary_in_usd, dtype: float64

### Сравним средние зарплаты в разных странах

In [7]:
sub = df.query('company_location == "RU" or company_location == "US"')

In [ ]:
sub.groupby('company_location')['salary_in_usd'].mean()

In [ ]:
sub.groupby('company_location')['salary_in_usd'].agg(['count', 'mean'])

In [57]:
df.groupby('experience_level')['salary_in_usd'].agg(['count', 'mean', 'median'])

                  count           mean    median
experience_level
EN                  239   79363.953975   71907.0
EX                   76  198120.828947  200000.0
MI                  603  104090.585406  100000.0
SE                 1953  152959.310292  146200.0

### Зарплаты по профессиям

In [58]:
df['job_title'].value_counts()

Data Engineer                          1040
Data Scientist                          840
Data Analyst                            612
Machine Learning Engineer               289
Analytics Engineer                      103
                                       ...
Principal Machine Learning Engineer       1
Azure Data Engineer                       1
Manager Data Management                   1
Marketing Data Engineer                   1
Finance Data Analyst                      1
Name: job_title, Length: 93, dtype: int64

In [59]:
df[df['job_title'].str.contains('Scientist')]['job_title'].value_counts()

Data Scientist                        840
Research Scientist                     82
Applied Scientist                      58
Machine Learning Scientist             26
AI Scientist                           16
Applied Machine Learning Scientist     12
Applied Data Scientist                 10
Lead Data Scientist                     9
Principal Data Scientist                8
Data Scientist Lead                     2
Product Data Scientist                  1
Staff Data Scientist                    1
Name: job_title, dtype: int64

In [ ]:
df['job_title'].value_counts().head(4)

In [60]:
(df.groupby('job_title')['salary_in_usd']
     .agg(['count', 'mean', 'median'])
     .sort_values(by='count', ascending=False)
     .head(4))

                           count           mean    median
job_title
Data Engineer                822  143353.740876  138125.0
Data Scientist               622  140449.696141  141525.0
Data Analyst                 471  109689.386412  106020.0
Machine Learning Engineer    216  156970.115741  150000.0

In [61]:
df.groupby('remote_ratio')['salary_in_usd'].agg(['count', 'mean', 'median'])

              count           mean    median
remote_ratio
0              1469  144878.148400  139500.0
50              148   80521.864865   63375.5
100            1254  136186.673046  136000.0

In [62]:
(df.query('(company_location == "US" or company_location == "CA") and employment_type == "FT"')
          .groupby(['company_location', 'experience_level'])['salary_in_usd']
          .agg(['count', 'mean', 'median']))

                                   count           mean    median
company_location experience_level
CA               EN                    5   82283.200000   52000.0
                 EX                    3  111004.333333  125976.0
                 MI                    8   83597.500000   75907.0
                 SE                   50  150022.020000  142050.0
US               EN                  130  105803.930769  100000.0
                 EX                   65  206903.507692  205000.0
                 MI                  367  128592.343324  121500.0
                 SE                 1754  158292.214937  150000.0

In [ ]:
df.groupby('remote_ratio')['salary_in_usd'].agg(['count', 'mean', 'median'])

# Домашнее задание

## Easy

Изучите распределение размеров компаний (`company_size`) с помощью метода `.value_counts()`. Опишите своими словами, что вы увидели.

In [12]:
# Ваш код ниже:
df['company_size'].value_counts()

M    3153
L     454
S     148
Name: company_size, dtype: int64

Вывод: 2294 Маленьких, 422 средних, 147 больших

## Normal

Сделайте выборку за 2023 год. Постройте по ней сводную таблицу, сгруппированную по размеру компании-работодателя (`company_size`), со средней и медианной зарплатой в долларах. Не забывайте также указать количество.

In [75]:
# Ваш код ниже:
df.query('work_year == 2023').groupby('company_size')['salary_in_usd'].agg(['count', 'mean', 'median'])

              count           mean    median
company_size
L                71  138622.845070  126100.0
M              1275  151126.316078  145000.0
S                17   73632.647059   53654.0

Напишите краткий вывод из полученной таблицы:

Вывод:

Аналогично исследуйте 2022 год. Есть ли отличия?

In [65]:
# Ваш код ниже:
df.query('work_year == 2022').groupby('company_size')['salary_in_usd'].agg(['count', 'mean', 'median'])

              count           mean    median
company_size
L               143  120581.482517  120000.0
M              1096  137245.859489  135000.0
S                40   75092.325000   58000.0

Вывод:

## Hard

Для начала попробуйте восстановить пропущенные значения `salary_in_usd`.

<details>
<summary>Подсказка (нажмите, чтобы посмотреть):</summary>
Один из способов:
    <ul><li>создайте дополнительный столбец с "курсом доллара" для каждого наблюдения;</li>
    <li>проверьте, менялся ли курс каждой валюты в течение года;</li>
    <li>по возможности примените этот курс для расчета пропущенного значения;</li>
    <li>если остались пропуски, которые нельзя заполнить, удалите их.</li></ul>    
</details>

Оставляйте комментарии в коде своего решения.

In [4]:
# Ваш код:
df_clean = df.copy()
df_clean['salary_in_usd'] = df_clean['salary_in_usd'].fillna(df_clean['salary'])
df_clean[df['salary_in_usd'].isna()]

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
20,2023,MI,FT,Data Analyst,110000,USD,110000.0,US,100,US,M
26,2023,SE,FT,Business Intelligence Engineer,156400,USD,156400.0,US,0,US,M
31,2023,SE,FT,Data Engineer,253200,USD,253200.0,US,0,US,M
32,2023,SE,FT,Data Engineer,90700,USD,90700.0,US,0,US,M
34,2023,SE,FT,Computer Vision Engineer,184590,USD,184590.0,US,0,US,M
...,...,...,...,...,...,...,...,...,...,...,...
3722,2021,MI,FT,Data Scientist,130000,USD,130000.0,US,50,US,L
3723,2021,SE,FT,Computer Vision Engineer,102000,BRL,102000.0,BR,0,BR,M
3724,2021,EN,FT,Business Data Analyst,50000,EUR,50000.0,LU,100,LU,L
3726,2020,SE,FT,Principal Data Scientist,130000,EUR,130000.0,DE,100,DE,M
3734,2021,MI,FT,Lead Data Analyst,1450000,INR,1450000.0,IN,100,IN,L

Дополнительно: попробуйте свести данные в столбце `job_title` к 4 основным профессиям (Data Scientist, Data Analyst, Data Engineer, ML Engineer), где это возможно.

In [9]:
# Ваш код:
options = ['Data Scientis', 'Data Analyst', 'Data Engineer', 'Machine Learning Engineer']     
rslt_df = df_clean[df_clean['job_title'].isin(options)]     
rslt_df

,work_year,experience_level,employment_type,job_title,salary,salary_currency,salary_in_usd,employee_residence,remote_ratio,company_location,company_size
11,2023,SE,FT,Data Analyst,130000,USD,130000.0,US,100,US,M
12,2023,SE,FT,Data Analyst,100000,USD,100000.0,US,100,US,M
19,2023,MI,FT,Data Analyst,150000,USD,150000.0,US,100,US,M
20,2023,MI,FT,Data Analyst,110000,USD,110000.0,US,100,US,M
27,2023,SE,FT,Machine Learning Engineer,200000,USD,200000.0,US,0,US,M
...,...,...,...,...,...,...,...,...,...,...,...
3737,2021,MI,FT,Data Analyst,62000,USD,62000.0,US,0,US,L
3739,2021,MI,FT,Data Engineer,38400,EUR,45391.0,NL,100,NL,L
3743,2020,MI,FT,Data Engineer,130800,USD,130800.0,ES,100,US,M
3744,2020,SE,FT,Machine Learning Engineer,40000,EUR,45618.0,HR,100,HR,S
3748,2021,MI,FT,Data Engineer,24000,EUR,28369.0,MT,50,MT,L

Сделайте выборку за 2023 год. Постройте по ней сводную таблицу, сгруппированную по профессии (`job_title`), со средней и медианной зарплатой в долларах. Не забывайте также указать количество. (Если у вас не получилось привести в порядок столбец `job_title`, выведите только 4 самых распространенных профессии.)

In [17]:
# Ваш код:
df_clean.query('work_year == 2023').groupby('job_title')['salary_in_usd'].agg(['count', 'mean', 'median']
    .sort_values(by='count', ascending=False).head(4))

AttributeError: 'list' object has no attribute 'sort_values'

Теперь давайте получше категоризируем зарплаты. Изучите самостоятельно документацию к функциям pandas [cut](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.cut.html) и [qcut](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.qcut.html). Используйте их, чтобы разбить зарплаты на три или больше категорий (например: `Low`, `Medium`, `High`) и запишите их в столбец `salary_range`.

Сделайте сводную таблицу по профессиям за 2023 год, где будут выведены:
- число работников в профессии;
- самая часто встречающаяся категория зарплаты.

<details>
<summary>Подсказка (нажмите, чтобы посмотреть):</summary>
<code>lambda x : pd.Series.mode(x)</code>
</details>

In [ ]:
# Ваш код:

Проверьте себя: совпадают ли категории с реальными цифрами?